---
kind: enumMember
id: F:Autodesk.Revit.DB.Mechanical.ComponentClassification.Pipe
enum: Autodesk.Revit.DB.Mechanical.ComponentClassification
zh: 管道、水管、管线
source: html/7abbd56a-3b9a-f51e-861c-5f034fec614e.htm
---
# Autodesk.Revit.DB.Mechanical.ComponentClassification.Pipe

**中文**: 管道、水管、管线

Straight pipe segment component classification